package codeWars;

public class JavaStaticInitializerBlock {

    /**
     * Статические блоки инициализации выполняются при загрузке класса, и вы можете инициализировать статические переменные в этих блоках.
     * Пришло время проверить свои знания о статических блоках инициализации. Вы можете прочитать об этом здесь.
     * Вам дан класс Solution с основным методом.
     * Дополните данный код так, чтобы он вывел площадь параллелограмма шириной B и высотой H.
     * Вы должны прочитать переменные из стандартного ввода.
     * Если B<=0 or H<=0 , вывод должен быть "java.lang.Exception: Breadth and height must be positive" без кавычек.
     * Формат ввода
     * Есть две строки ввода. Первая строка содержит B: ширину параллелограмма. В следующей строке записано H: высота параллелограмма.
     * Формат вывода
     * Если оба значения больше нуля, то основной метод должен вывести площадь параллелограмма.
     * В противном случае выведите «java.lang.Exception: Breadth and height must be positiv» без кавычек.
     */

//    public static void main(String[] args){
//        if(flag){
//            int area=B*H;
//            System.out.print(area);
//        }

//    }//end of main

}

class Test {

}